#### Terraform Format and Style 🖌: `success`
#### Terraform Initialization ⚙️: `success`
#### Terraform Validation 🤖: `success`
#### Terraform Plan 📖: `success`

<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/39a56565-ecf7-4a8c-ba13-33329fae9075/terraform-bin plan
[0m[1maws_iam_user.test_role: Refreshing state... [id=test_user][0m
[0m[1maws_iam_user_policy.test_s3: Refreshing state... [id=test_user:test][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # aws_apprunner_service.datadog_agent_service[0m will be created
[0m  [32m+[0m[0m resource "aws_apprunner_service" "datadog_agent_service" {
      [32m+[0m[0m arn                            = (known after apply)
      [32m+[0m[0m auto_scaling_configuration_arn = (known after apply)
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m service_id                     = (known after apply)
      [32m+[0m[0m service_name                   = "datadog-agent-service"
      [32m+[0m[0m service_url                    = (known after apply)
      [32m+[0m[0m status                         = (known after apply)
      [32m+[0m[0m tags_all                       = (known after apply)

      [32m+[0m[0m source_configuration {
          [32m+[0m[0m auto_deployments_enabled = true

          [32m+[0m[0m image_repository {
              [32m+[0m[0m image_identifier      = "245918101727.dkr.ecr.eu-west-3.amazonaws.com/dd-test:latest"
              [32m+[0m[0m image_repository_type = "ECR"
            }
        }
    }

[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m datadog_service_arn = (known after apply)
[90m
──────────────────────────────────────────────�

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @gnublin, Action: `pull_request`, Workflow: `Run Terraform checks`*